#include <iostream>
using namespace std;

int main (){
	
	int n; cin>>n;
	
	if (n<2500)	//若號碼<2500則在第一區 
		cout<<1<<" "<<n/25+(n%25!=0)<<" "<<n%25+(n%25==0)*25;	//第幾排要利用邏輯判斷(若餘數不為0)決定再+1排。第幾個位置要注意若整除時應是坐在第25個位置 
		
	else if (n>7500)	//號碼>7500則在第三區 
		cout<<3<<" "<<(n-7500)/25+((n-7500)%25!=0)<<" "<<(n-7500)%25+((n-7500)%25==0)*25;	//算第幾排必須先把號碼-2500再除以50，一樣用邏輯判斷多+1排 
	
	else	//其他號碼就在第二區 
		cout<<2<<" "<<(n-2500)/50+((n-2500)%50!=0)<<" "<<(n-2500)%50+((n-2500)%50==0)*50;
		
	return 0;
}
